Revit 2027 API
RebarHandlesData.GetRebarElement Method
 Gets the rebar element that will be updated by the server.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Rebar GetRebarElement()
Public Function GetRebarElement As Rebar
public:
Rebar^ GetRebarElement()
member GetRebarElement : unit -> Rebar
Return Value
Rebar
 Returns the rebar element that will be updated by the server.
See Also
Reference
RebarHandlesData Class
Autodesk.Revit.DB.Structure Namespace